package utils

import (
	"fmt"
)

func diary() {
	//这里是龙哥提交的数据


	
	//2023年5月22日	10:01:28
	//	博涛周一周二来我家住了两天我胖了五斤,之后周三周四我把这五斤减掉了，周六晚上博涛来我家吃饭，今天周一我有胖了两斤。emmmm
	//	上周周五打麻将输了140 周日打麻将 输了100 emmmm
	//2023年5月24日	10:41:45
	//	昨天晚上11点被叫去打台球 玩到2点 三点才睡 我一直赢 平常也就让一让 昨天我躺床上了叫我出来 必须体验一下我的起床气
	//2023年6月14日	14:57:29
	//	最近过得都还可以，就是程程、博涛都回去了，小姜来杭州玩了两天也回去了，打了两天麻将，输了好多哈哈哈，小杨也找到工作了，不知道刘晨工作怎么样了，希望都一切顺利吧。
	//2023年6月19日	09:58:46
	//	周五打麻将赢了100多 昨天打麻将输了300多 周六团建给同事扒小龙虾 把手给烫了 周日吃烤羊腿  把嘴给烫了 今天上班 接下来半个月的主题是防止拖延症
	//2023年6月25日	10:10:42
	// 	端午节放假三天 第一天和同事玩剧本杀，晚上一起吃了烤肉，感觉00后的小姑娘有很大的差别，确实年纪大了不太懂了。这种感觉就是传说中的代沟吧。
	//	第二天，躺了一天很无聊，下午两点多家辉说要去猫咖，小陆提议要去打麻将，最后决定去打麻将，打到10点，输了330多，小陆把台费付了，奶茶钱付了真不错，8月份之前不打麻将了。
        //	第三天，小倪叫我打台球，在上城，约的6.30，躺了一天很累，3点多出门，在钱塘江边逛了一个多小时，江不错，雨下的也很大。9点半去玩了一个密室，三男五女，还不错。
	//2023年7月12日	09:33:19
	//	今天小杨要回东北了，现在应该已经踏上回家的路程了吧，又一个玩的很好的盆友回家了。虽然已经是一个成年人了，也经历了不少的离别，但是伤感的情绪还是在心头弥漫	
        //	杭州今天的天气，一点云彩都没有，特别的蓝，估计也是知道小杨要回家了，所以把前路的云彩都赶走，告诉她前路光明。
	//	写着写着想起来，四天前和小杨打麻将输了162,emmm,小杨回去一定要挣大钱
	//2023年7月17日	17:17:48
	//	上学了DOCKER 这是我至少第五次学习docker简单说就是取得了一点进展，最后还没没整明白。
	//	14号晚上和羽儿打语音打到11点，后来钱程叫我打台球打到1点回家睡觉已经三点了。
	//	15号10点多醒了，中午和媛聊会天，她说中午吃的是韩式拌饭，那我也吃这个吧，2点半准备出门的时候，麻将机到了。需要搬到小陆家里小陆住四楼，我和家辉两个人去的。太沉了啊我草啊。
	//麻将机从一楼搬到四楼，我还一天没吃饭了，我们俩搬一层歇一层，杭州还40度我凑啊，一边搬一边暴汗，累死了我凑。搬完去韩式拌饭，店关门了。准备去下一家，距离还有3.1km，我看着我全身的暴汗。
	//果断选择了附近的猪脚饭。吃饭就回家躺着休息了。晚上5点晨和小鹿还有家辉把麻将机拼好，开始打麻将到11点。输了320，4点钟睡的觉。
	//	17号玩剧本杀有17、家辉、家辉对象。四点半开始，地方离钱塘江很近，上次去附近玩，下雨天去江边逛了一下，不美，这次想带着家辉他俩一起去江边逛一逛，路程一小时，日常提前半个小时，
	//江边逛半个小时，所以两点钟出门，到了江边，下雨了，很大，没走两步就下雨了，很难受。转头去剧本杀店里，到达时间15点40。5点钟开始玩，我叫花枝丸，我杀了毛利小四郎，因为他吃关东煮不吃丸子
	//玩到晚上11点。脑子完全已经停转了。12点半睡的觉。
	//2023年7月19日	17:54:05
	//	这个月借出去2K，随礼1K，冲自助餐厅会员0.6K，打麻将输了0.6K，后面还有还有20天才能发工资。这个月要控制花销了。
	//	朋友结婚，羡慕了，我要是有个人能结婚就好了。






	
	//2024年05月06日 10:32:53
	//	一年过去了又要开始写日记了，先看了下去年的日记感觉好有意思啊。原来去年的那两个月我过的有点精彩，不看日记，回忆一下感觉开心不起来。看了日记笑的哈哈的
	//	五一放了五天假，放假下班的那天，和 花  花花 白羊 吃了一顿火锅 很开心。
	//	第一天 1号 和钱程  钱程父母 钱程对象 去桐庐吃炖大鹅 感觉是很轻松的一天，很开心。
	//	第二天 2号 刘晨一对 家辉一对 慧琳一对 17一对 老庄 小陆 我们11个人 去下沙烧烤 玩了一下午的狼人杀 也是热热闹闹的一天
	//	第三天 3号 和17 还有娓娓 还有几个不认识的人 在一个人家里 玩了一个剧本杀叫丁达尔克的奇妙夜 也很好玩
	//      第四天 4号 下雨了 在家躺了一天
	//      第五天 5号 和破晓 以前完了一个机制本 叫万灵之战 玩了10个小时 很棒 晚上九点多才回家
	//      嚯 这么一看 我这个五一 和 五波不同的朋友聚了一下 一个小小的交际花 哈哈哈
	//2024年5月7日14:14:24
	//	昨天上班忙了一天工作上没啥说的
	//	回家之后思考了一下目前的状态，感觉拖延症很严重，主要就是回家太累了什么都不想动。
	//      还有就是熬夜玩手机，是一个恶性循环，最近看了一本书叫微习惯，稍微有一点思路，说是习惯是因为比较容易，戒掉这个习惯相当于跟自己的意识做对抗，反人类的操作做起来都很痛苦
	//	我的思路就是在培养其他的习惯把玩手机的时间挤占掉，我感觉我这个想法很机智，我先坚持一段时间试一试。
	//2024年5月8日13:39:04
	//	昨天上班忙了一天，很困，和同事battle了两次。感觉对待同事的态度不是很好。需要调整一下
	//	中午的时候和同事玩狼人杀，我发现发言环节她们在玩手机，看别人玩手机，互相讨论，没有人听发言，也好像听了，也好像没听。
	//	晚上下班的时候，顺路一起坐的女同事，我说了几句天气，说了几句话，，都没有搭话茬，我想假如我不说话会怎么样，okk 沉默了一路，往常都会在一个地铁门前上车，她也悄悄的走到了其他的门前
	//	今天想想昨天的这些事情，其实跟自己都没什么关系，玩的不开心就不参与，上班本来也是自己上下班没什么不同。
	//	但是昨天也确实影响到了我的情绪。注意力放在自己的身上，其他人的行为，和我没有什么关系，也没有意义。这糟糟乱乱的生活需要一些钝感力。
	//2024年5月9日15:40:32
	//	昨天好像什么都想不起来了，说明昨天没有很不开心的事情,那我就要想想开心的事情有哪些。看来开心的事情容易忘记。
	//	上午的情绪还在前天的情绪里面，下午的时候写完了日记，感觉思想上豁然开朗，情绪一下子就有了宣泄的出口，不堵了。哈哈
	//	昨天一个半年没有联系的朋友，突然说话了，平淡日子里的惊喜，推荐我青藤之恋。。emmm 三年前我就注册过、要求高中以上学历才能注册
	//	她说、她的朋友在上面找到对象今年要结婚了，推荐我也用一下，并且让我今年加加油，努力找个对象。我谢谢、表示今年会努力的
	//2024年5月10日11:00:13
	//	昨天上写了20来行代码，今天不能那么摸鱼了
	//	这两天和博涛推给我的那个女生开始聊天了，感觉自己说话跟不上她的节奏。
	//	而且她算命有一手的，算的那些东西，不知道从哪里来的，算的好准啊
	//	晚上的时候，庆祝前一天减肥成功，和 花 花花 白羊 四个人吃了火锅，很好吃，下回带家辉小陆他们一起去吃
	//2024年5月11日15:49:07
	//	昨天就下午写了一段时间代码，稍微有点懈怠了
	//	昨天去家辉家里吃饭了，还有小陆，家辉做饭水平恢复了，吃完之后我感觉又胖不少。
	//	在家辉家里玩了，小陆买的德国心脏病这个游戏，游戏很不错很好玩。
	//	我们三个人喝了三斤百香果啤酒，好久没有一起喝酒了，吃完饭回家的路上看到别人家吵架，小陆还提议看热闹去。
	//	这两个人虽然目前还在找工作，但是看起来精神状态很不错，很好。
	//2024年5月11日16:37:45
	//	今天就写了吧，明天就放假了，没有时间写日记了
	//	今天还是和一个很久没有聊天的朋友聊了几句，原本我以为不可能在聊天了，没想到我就在朋友圈点了个赞，我们竟然能因为她发的朋友圈聊上几句，感觉也是很神奇的一件事情。
	//	今天还看了一下计算机本科自考的 可选择的两个学校一个是华中科技大学 和电子科技大学 华中在武汉 电子科技在成都 我想去成都看看 所以我准备报电子科技大学的计算机自考本
	//2024年5月13日13:59:46
	//	昨天周日 家辉 小陆 刘晨 和我  我们四个人打麻将  终于赢了70 不容易啊 打了这么久麻将终于赢了一次
	//	打完麻将 我们去吃了牛肉自助火锅 很便宜70一位 
	//	这几个人吃的太少了 还没有我一个人吃的多，简单说就是没有吃回本  不太开心
	//2024年5月14日11:31:40 星期二
	//	昨天周一上班 还是按部就班的完成了一些任务
	//	昨天没有什么人生思考，也没有发生什么事情。博涛说这个项目不能只提交注释，昨天我就看了一会GO的教程，之后会提交一些代码的
	//2024年5月15日15:57:45 星期三
	//	昨天工作是一点都没做
	//	帮勤儿解决了一下前端的BUG，俊杰好久没聊天了还聊了几句，还和 花 花花 白羊 去吃了一顿火锅
	//2024年5月16日14:32:14 星期四
	//	昨天工作做了很多，下班的时候有个客户的钱发布出去，还加班进行调试了。
	//	昨天去小陆家看了他的电脑，硬盘有问题了准备换个硬盘，原先是机械硬盘准备换个固态硬盘
	//	昨天睡1点之前睡的，很好很不错，因为前一天是五点睡的，昨天完成了一个成就就是躺床上没玩手机。手机我放远处了。物理上杜绝我睡觉之前看手机
	//2024年5月17日18:20:49 星期五
	//	昨天工作了，有个时间筛选有问题，调整了一下
	// 	昨天去健身房跑步了，跑了半个小时，体重掉到了147.3 很好 很开心
	//2024年5月18日15:45:20 星期六
	//	昨天工作也是挺忙的，但是忘记了都忙啥了
	//	昨天去跑步了很有效果体侧说我的身体已经年轻了一岁，昨天36，今天35，按照这个速度我这个月结束应该就可以回到上小学了
	//	昨天思考了一下缓解焦炉的几种办法，第一花钱，第二整理归纳，第三看书，第四运动。
	//2024年5月21日14:11:30 星期二
	//	这几天工作有点忙的，把一个发短信功能写的极其复杂 哈哈哈哈哈
	//	周六的晚上和朋友去喝酒，一个酒鬼巡街的活动，一共七杯酒去七家店，刚开始三个人，喝到后面15个人，第二天醒来多了三个朋友的微信，没喝多，就是这三个人有点意思的
	//	一个人说我头型像陈奕迅，一个说我某个角度像彭于晏，还有一个国美的艺术生，从他的专业上夸奖我，很快乐。哈哈哈哈哈哈
	//	周日去玩了一个情感本，很刀，我是皇帝，侍卫爱我，一直默默付出，最后死了，死了之后，原来我们师兄妹，我失忆了，太刀了。
	//	昨天周一，因为专科的毕业证需要头发要露额头，露耳朵，我去把头发剪了，染了黑色。跟理发店的老板一顿聊，那个老板说话，嗯，，，， 很尬
	//2024年5月28日18:13:14
	//	这段时间都发生啥了我想想，工作上就是一直很忙没什么事情。
	//	周六又去酒鬼巡游那个活动了，还挺有意思的，遇到了一个叫徐俊杰的男孩子，我有个好朋友女孩子叫徐俊杰也是很巧了，可以这个男孩子有点弯，要不就介绍给徐俊杰了。
	//	周六喝酒喝到12点，之后就去KTV了，好多人啊10几个人一起玩大家也不认识，玩到两点，想着第二天还要打麻将就早早结束回家了。
	//	之后手机就丢了，落在高德的车上了，司机电话死活打不通，打到四点，顶不住睡觉了。八点起来，忙活公司的事情加了个班
	//	九点多快到10点，刘晨带我去营业厅补卡，要三个拨打过的电话号码，emmm 没有就要去办卡地 广东 东莞 补卡。。。。。。。。
	//	卡没补成，12点半去小陆那打麻将，打到六点多，输了100。我想想就来气，丢手机，在家加班，补卡还没补到，还输钱，操，报警。
	//	报警，联系上司机了，司机把手机给我还回来了，还是警察靠谱啊。
}

func main() {
	//简单输出
	//Printf函数用于格式化输出，它接受一个格式化字符串作为第一个参数，后面跟着一系列可变参数，这些参数将按照格式化字符串中的占位符被替换并输出。
	//格式化字符串中可以包含占位符（如%d、%s、%f等），用于指定要插入值的类型和格式。
	//Printf不会自动在输出末尾添加换行符，因此如果需要换行，你需要在格式化字符串中显式地添加\n。
	fmt.Printf(studyFirst()) //控制台输出 study1

	//计算相加输出 要么加格式说明符[占位符]%d 要么用strconv.Itoa转换为字符串 不可以直接输出
	fmt.Printf("%d", studySecond(1, 2)) //控制台输出3

	//引入符号计算输出
	// 如果计算没有错误，则打印result
	if result, err := studyThird(1, 0, "/"); err == nil {
		// 如果没有错误，则打印result
		fmt.Printf("%d\n", result) //控制台输出2
	} else {
		// 如果有错误，则处理错误（这里只是简单地打印错误）
		////Println函数接受任意数量的参数，并将它们以空格分隔的形式输出到标准输出。
		//		//它会在每个参数之后（以及整个输出之后）自动添加一个换行符。
		//		//Println不接受格式化字符串，因此你不能指定值的输出格式。
		e := 123
		fmt.Println("Error:", err, "study3", e)
		//当调用 study3(1, 2, "**") 控制台输出 Error: 您的计算符号**不正确 study3 123
	}

}
