package utils

func diary() {
	//这里是龙哥提交的数据
	Diary2023()
	Diary2024()
}

func Diary2023(){
	//2023年5月22日	10:01:28
	//	博涛周一周二来我家住了两天我胖了五斤,之后周三周四我把这五斤减掉了，周六晚上博涛来我家吃饭，今天周一我有胖了两斤。emmmm
	//	上周周五打麻将输了140 周日打麻将 输了100 emmmm
	//2023年5月24日	10:41:45
	//	昨天晚上11点被叫去打台球 玩到2点 三点才睡 我一直赢 平常也就让一让 昨天我躺床上了叫我出来 必须体验一下我的起床气
	//2023年6月14日	14:57:29
	//	最近过得都还可以，就是程程、博涛都回去了，小姜来杭州玩了两天也回去了，打了两天麻将，输了好多哈哈哈，小杨也找到工作了，不知道刘晨工作怎么样了，希望都一切顺利吧。
	//2023年6月19日	09:58:46
	//	周五打麻将赢了100多 昨天打麻将输了300多 周六团建给同事扒小龙虾 把手给烫了 周日吃烤羊腿  把嘴给烫了 今天上班 接下来半个月的主题是防止拖延症
	//2023年6月25日	10:10:42
	// 	端午节放假三天 第一天和同事玩剧本杀，晚上一起吃了烤肉，感觉00后的小姑娘有很大的差别，确实年纪大了不太懂了。这种感觉就是传说中的代沟吧。
	//	第二天，躺了一天很无聊，下午两点多家辉说要去猫咖，小陆提议要去打麻将，最后决定去打麻将，打到10点，输了330多，小陆把台费付了，奶茶钱付了真不错，8月份之前不打麻将了。
        //	第三天，小倪叫我打台球，在上城，约的6.30，躺了一天很累，3点多出门，在钱塘江边逛了一个多小时，江不错，雨下的也很大。9点半去玩了一个密室，三男五女，还不错。
	//2023年7月12日	09:33:19
	//	今天小杨要回东北了，现在应该已经踏上回家的路程了吧，又一个玩的很好的盆友回家了。虽然已经是一个成年人了，也经历了不少的离别，但是伤感的情绪还是在心头弥漫	
        //	杭州今天的天气，一点云彩都没有，特别的蓝，估计也是知道小杨要回家了，所以把前路的云彩都赶走，告诉她前路光明。
	//	写着写着想起来，四天前和小杨打麻将输了162,emmm,小杨回去一定要挣大钱
	//2023年7月17日	17:17:48
	//	上学了DOCKER 这是我至少第五次学习docker简单说就是取得了一点进展，最后还没没整明白。
	//	14号晚上和羽儿打语音打到11点，后来钱程叫我打台球打到1点回家睡觉已经三点了。
	//	15号10点多醒了，中午和媛聊会天，她说中午吃的是韩式拌饭，那我也吃这个吧，2点半准备出门的时候，麻将机到了。需要搬到小陆家里小陆住四楼，我和家辉两个人去的。太沉了啊我草啊。
	//麻将机从一楼搬到四楼，我还一天没吃饭了，我们俩搬一层歇一层，杭州还40度我凑啊，一边搬一边暴汗，累死了我凑。搬完去韩式拌饭，店关门了。准备去下一家，距离还有3.1km，我看着我全身的暴汗。
	//果断选择了附近的猪脚饭。吃饭就回家躺着休息了。晚上5点晨和小鹿还有家辉把麻将机拼好，开始打麻将到11点。输了320，4点钟睡的觉。
	//	17号玩剧本杀有17、家辉、家辉对象。四点半开始，地方离钱塘江很近，上次去附近玩，下雨天去江边逛了一下，不美，这次想带着家辉他俩一起去江边逛一逛，路程一小时，日常提前半个小时，
	//江边逛半个小时，所以两点钟出门，到了江边，下雨了，很大，没走两步就下雨了，很难受。转头去剧本杀店里，到达时间15点40。5点钟开始玩，我叫花枝丸，我杀了毛利小四郎，因为他吃关东煮不吃丸子
	//玩到晚上11点。脑子完全已经停转了。12点半睡的觉。
	//2023年7月19日	17:54:05
	//	这个月借出去2K，随礼1K，冲自助餐厅会员0.6K，打麻将输了0.6K，后面还有还有20天才能发工资。这个月要控制花销了。
	//	朋友结婚，羡慕了，我要是有个人能结婚就好了。
}

func Diary2024(){
	//2024年05月06日 10:32:53
	//	一年过去了又要开始写日记了，先看了下去年的日记感觉好有意思啊。原来去年的那两个月我过的有点精彩，不看日记，回忆一下感觉开心不起来。看了日记笑的哈哈的
	//	五一放了五天假，放假下班的那天，和 花  花花 白羊 吃了一顿火锅 很开心。
	//	第一天 1号 和钱程  钱程父母 钱程对象 去桐庐吃炖大鹅 感觉是很轻松的一天，很开心。
	//	第二天 2号 刘晨一对 家辉一对 慧琳一对 17一对 老庄 小陆 我们11个人 去下沙烧烤 玩了一下午的狼人杀 也是热热闹闹的一天
	//	第三天 3号 和17 还有娓娓 还有几个不认识的人 在一个人家里 玩了一个剧本杀叫丁达尔克的奇妙夜 也很好玩
	//      第四天 4号 下雨了 在家躺了一天
	//      第五天 5号 和破晓 以前完了一个机制本 叫万灵之战 玩了10个小时 很棒 晚上九点多才回家
	//      嚯 这么一看 我这个五一 和 五波不同的朋友聚了一下 一个小小的交际花 哈哈哈
	//2024年5月7日14:14:24
	//	昨天上班忙了一天工作上没啥说的
	//	回家之后思考了一下目前的状态，感觉拖延症很严重，主要就是回家太累了什么都不想动。
	//      还有就是熬夜玩手机，是一个恶性循环，最近看了一本书叫微习惯，稍微有一点思路，说是习惯是因为比较容易，戒掉这个习惯相当于跟自己的意识做对抗，反人类的操作做起来都很痛苦
	//	我的思路就是在培养其他的习惯把玩手机的时间挤占掉，我感觉我这个想法很机智，我先坚持一段时间试一试。
	//2024年5月8日13:39:04
	//	昨天上班忙了一天，很困，和同事battle了两次。感觉对待同事的态度不是很好。需要调整一下
	//	中午的时候和同事玩狼人杀，我发现发言环节她们在玩手机，看别人玩手机，互相讨论，没有人听发言，也好像听了，也好像没听。
	//	晚上下班的时候，顺路一起坐的女同事，我说了几句天气，说了几句话，，都没有搭话茬，我想假如我不说话会怎么样，okk 沉默了一路，往常都会在一个地铁门前上车，她也悄悄的走到了其他的门前
	//	今天想想昨天的这些事情，其实跟自己都没什么关系，玩的不开心就不参与，上班本来也是自己上下班没什么不同。
	//	但是昨天也确实影响到了我的情绪。注意力放在自己的身上，其他人的行为，和我没有什么关系，也没有意义。这糟糟乱乱的生活需要一些钝感力。
	//2024年5月9日15:40:32
	//	昨天好像什么都想不起来了，说明昨天没有很不开心的事情,那我就要想想开心的事情有哪些。看来开心的事情容易忘记。
	//	上午的情绪还在前天的情绪里面，下午的时候写完了日记，感觉思想上豁然开朗，情绪一下子就有了宣泄的出口，不堵了。哈哈
	//	昨天一个半年没有联系的朋友，突然说话了，平淡日子里的惊喜，推荐我青藤之恋。。emmm 三年前我就注册过、要求高中以上学历才能注册
	//	她说、她的朋友在上面找到对象今年要结婚了，推荐我也用一下，并且让我今年加加油，努力找个对象。我谢谢、表示今年会努力的
	//2024年5月10日11:00:13
	//	昨天上写了20来行代码，今天不能那么摸鱼了
	//	这两天和博涛推给我的那个女生开始聊天了，感觉自己说话跟不上她的节奏。
	//	而且她算命有一手的，算的那些东西，不知道从哪里来的，算的好准啊
	//	晚上的时候，庆祝前一天减肥成功，和 花 花花 白羊 四个人吃了火锅，很好吃，下回带家辉小陆他们一起去吃
	//2024年5月11日15:49:07
	//	昨天就下午写了一段时间代码，稍微有点懈怠了
	//	昨天去家辉家里吃饭了，还有小陆，家辉做饭水平恢复了，吃完之后我感觉又胖不少。
	//	在家辉家里玩了，小陆买的德国心脏病这个游戏，游戏很不错很好玩。
	//	我们三个人喝了三斤百香果啤酒，好久没有一起喝酒了，吃完饭回家的路上看到别人家吵架，小陆还提议看热闹去。
	//	这两个人虽然目前还在找工作，但是看起来精神状态很不错，很好。
	//2024年5月11日16:37:45
	//	今天就写了吧，明天就放假了，没有时间写日记了
	//	今天还是和一个很久没有聊天的朋友聊了几句，原本我以为不可能在聊天了，没想到我就在朋友圈点了个赞，我们竟然能因为她发的朋友圈聊上几句，感觉也是很神奇的一件事情。
	//	今天还看了一下计算机本科自考的 可选择的两个学校一个是华中科技大学 和电子科技大学 华中在武汉 电子科技在成都 我想去成都看看 所以我准备报电子科技大学的计算机自考本
	//2024年5月13日13:59:46
	//	昨天周日 家辉 小陆 刘晨 和我  我们四个人打麻将  终于赢了70 不容易啊 打了这么久麻将终于赢了一次
	//	打完麻将 我们去吃了牛肉自助火锅 很便宜70一位 
	//	这几个人吃的太少了 还没有我一个人吃的多，简单说就是没有吃回本  不太开心
	//2024年5月14日11:31:40 星期二
	//	昨天周一上班 还是按部就班的完成了一些任务
	//	昨天没有什么人生思考，也没有发生什么事情。博涛说这个项目不能只提交注释，昨天我就看了一会GO的教程，之后会提交一些代码的
	//2024年5月15日15:57:45 星期三
	//	昨天工作是一点都没做
	//	帮勤儿解决了一下前端的BUG，俊杰好久没聊天了还聊了几句，还和 花 花花 白羊 去吃了一顿火锅
	//2024年5月16日14:32:14 星期四
	//	昨天工作做了很多，下班的时候有个客户的钱发布出去，还加班进行调试了。
	//	昨天去小陆家看了他的电脑，硬盘有问题了准备换个硬盘，原先是机械硬盘准备换个固态硬盘
	//	昨天睡1点之前睡的，很好很不错，因为前一天是五点睡的，昨天完成了一个成就就是躺床上没玩手机。手机我放远处了。物理上杜绝我睡觉之前看手机
	//2024年5月17日18:20:49 星期五
	//	昨天工作了，有个时间筛选有问题，调整了一下
	// 	昨天去健身房跑步了，跑了半个小时，体重掉到了147.3 很好 很开心
	//2024年5月18日15:45:20 星期六
	//	昨天工作也是挺忙的，但是忘记了都忙啥了
	//	昨天去跑步了很有效果体侧说我的身体已经年轻了一岁，昨天36，今天35，按照这个速度我这个月结束应该就可以回到上小学了
	//	昨天思考了一下缓解焦炉的几种办法，第一花钱，第二整理归纳，第三看书，第四运动。
	//2024年5月21日14:11:30 星期二
	//	这几天工作有点忙的，把一个发短信功能写的极其复杂 哈哈哈哈哈
	//	周六的晚上和朋友去喝酒，一个酒鬼巡街的活动，一共七杯酒去七家店，刚开始三个人，喝到后面15个人，第二天醒来多了三个朋友的微信，没喝多，就是这三个人有点意思的
	//	一个人说我头型像陈奕迅，一个说我某个角度像彭于晏，还有一个国美的艺术生，从他的专业上夸奖我，很快乐。哈哈哈哈哈哈
	//	周日去玩了一个情感本，很刀，我是皇帝，侍卫爱我，一直默默付出，最后死了，死了之后，原来我们师兄妹，我失忆了，太刀了。
	//	昨天周一，因为专科的毕业证需要头发要露额头，露耳朵，我去把头发剪了，染了黑色。跟理发店的老板一顿聊，那个老板说话，嗯，，，， 很尬
	//2024年5月28日18:13:14
	//	这段时间都发生啥了我想想，工作上就是一直很忙没什么事情。
	//	周六又去酒鬼巡游那个活动了，还挺有意思的，遇到了一个叫徐俊杰的男孩子，我有个好朋友女孩子叫徐俊杰也是很巧了，可以这个男孩子有点弯，要不就介绍给徐俊杰了。
	//	周六喝酒喝到12点，之后就去KTV了，好多人啊10几个人一起玩大家也不认识，玩到两点，想着第二天还要打麻将就早早结束回家了。
	//	之后手机就丢了，落在高德的车上了，司机电话死活打不通，打到四点，顶不住睡觉了。八点起来，忙活公司的事情加了个班
	//	九点多快到10点，刘晨带我去营业厅补卡，要三个拨打过的电话号码，emmm 没有就要去办卡地 广东 东莞 补卡。。。。。。。。
	//	卡没补成，12点半去小陆那打麻将，打到六点多，输了100。我想想就来气，丢手机，在家加班，补卡还没补到，还输钱，操，报警。
	//	报警，联系上司机了，司机把手机给我还回来了，还是警察靠谱啊。
	//2024年6月11日17:57:43 星期二
	//	哦吼，一下子快半个月过去了，从上次丢手机到现在，喝了两次断片了两次。
	//	好像也没有其他的事情了
	//2024年6月17日15:40:18 星期一
	//	我想想这段时间都发生了什么
	//	度过了一个愉快的6.1 和小陆还有家辉，小小杨，17,小火龙一起玩了一个密室，头号目标还挺好玩的，还去KTV去唱歌了，晚上还遇到了排队风波，以后吃饭我支持等位，安排等位可太吓人了
	//	吃完火锅，我还去喝酒了，喝了很多酒之后就断片了，在之后就去了温莎去唱歌了，哈哈哈，第二天就休息了一天
	//	7号的时候，世界说让我帮录制一个视频的脚本，还请我去了一个非常实惠的一个饭馆，很不错真的
	//	8号和勤儿吃火锅，她为了感谢我一直以来的帮助，请我吃四川火锅，她还夸我比去年的状态年轻好多，哈哈哈哈，好开心，我还准备了她的生日礼物，是一个立式鼠标，她有手脖子有腱鞘炎，
	//	跟她说过两次，这个鼠标可以缓解，但是她自己总是不买，那这次就当生日礼物送给她，哈哈哈哈。
        //      吃完火锅我就又去小猫、输入喝酒了，这回断片的更严重了，哈哈哈哈哈，风扇都忘记在店里了，而且还喝到了新的酒，70度的苦艾，96的生命之水，最后是飞鱼，输入，小猫三个人给我送回家的
	//	现在回忆起来那一天都很开心，应该是喝酒开心吧，哈哈哈哈
	//	9号和白羊，花，花花，去吃了火锅，一天没吃东西，前一天还喝那么多，家里一片狼藉，胃就不是很舒服，整个人都是傻傻的，酒喝多了反应就很迟钝了。
	//	10号本来约了 远友，但是10号下雨，远友说不想出门，我买的脱口秀的门票都浪费了，200多很心疼。我就联系的琳琳，她之前叫我打麻将，因为我跟远友一年半没见了
	//	我想见见远友，就给推掉了，这回正好再联系一下，打了一下午麻将，晚上还去吃的火锅，是个牛蛙锅。
	//	琳琳之前是我玩情感本的时候加的女生，我觉得我应该是有一些想法的，我们很密切的聊过一个星期天，我约她一起出来爬山，带她去我最喜欢的一家店吃饭，后面就突然不怎么联系了
	//	可能我的想法并没有被完全扑灭吧，我还约过她几次去玩本，叫她去游乐园都拒绝了，她约了我两次打麻将，这次打完麻将，我就突然感觉我们百分百的不合适了，突然就是一切的情绪都断开了，这个人不重要了，这个感觉很奇妙。
	//	13号 和VIVI 还有输入 又在五斗喝酒了，我还口腔溃疡，聊了一些工作啊，感情啊，生活啊，一些杂七杂八的东西。从10点半喝到了1点多，想想也是很不错的，想喝酒的时候就能有人一起，也是一种幸福
	//	15号 和老庄一起去 临平滑雪，第一次滑雪，感觉好好玩啊，滑了四个小时，还想去滑雪，就是雪服汗臭味比较大。家辉去四川了，去不了，小陆说夏天滑雪听起来比较奇怪，我叫勤儿，她要加班，其他的朋友也都没有时间。
	//	这么好玩的事情，他们没来，他们好可惜啊。哈哈哈哈。碰巧的是 老庄还过生日，我和老庄去吃了日式烤肉，很好吃，我说这个滑雪还有烤肉，就当是给老庄的生日礼物，还跟老庄说了生日快乐，哈哈哈哈哈
	//	跟老庄之晚饭，之后就去和小猫 输入 VIVI 去吃小龙虾， 之后又去了 黑木喝酒 喝到了四点钟 这一天 好忙啊 哈哈哈哈
	//	16号 11点起来赶紧就出门了，约好了和破晓玩剧本杀，可千万不能迟到，我很准时的提前到了10分钟。没想到破晓在小红书找的女生，跳车了，直接失踪了很夸张的那种。头一次减到这种人，前一天晚上还在群里说话
	//	第二天人不回电话，不回信息，玩失踪，真可怕，后来破晓发挥人脉叫了 主教过来玩本，1。30多开本，玩到0.30 11个小时太可怕了，我感觉我有点不太想玩剧本杀了，时间太长了。
	//	回家就赶紧睡觉了。
	//	这段时间，这么一复盘感觉好精彩啊，小陆，家辉，小小杨，17，小火龙，小猫，输入，飞鱼，白羊，花，花花，琳琳，勤儿，老庄，VIVI。这这么多朋友都一起玩了哈哈哈哈
	//	真开心啊 哦吼
	//2024年6月25日10:04:36 星期二
	//	时间过的真快啊一晃眼一个星期就过去了，我想一想这一个星期都做了什么
	//	吃了一个星期的粽子，30多个朋友给的公司给的全吃光了，还有很多的鸭蛋。没有去跑步锻炼，因为上个星期的作息不是很好，一直在调整作息，今天往前看的话，感觉作息调整的不错，但是体重也是蹭蹭的往上涨了一些。
	//	17号-21号都是每天上班调整作息，很平静。
	//	21号周五，先是和花花，花，白羊，还有花的朋友，去吃了地锅鸡，在我家楼下的那一家，感觉还不错很好吃。
	//	吃完就回家了，等到快12点的时候，琳琳就叫我去LiveHouse去喝酒，我就去了，有麻花，还有三个第一次见的人，刚开始大家都不怎么交流，后来喝酒摇色子，慢慢就气氛好了起来。
	//	我和麻花，还有一男一女，四个人在摇色子，琳琳和一个我感觉张的还可以的男生，在另一边，两个人在聊天喝酒，因为环境比较吵，说话都要贴在耳边要不就得喊，显得比较亲昵，
	//	在后面，应该是喝多了吧，直接靠在那个男生身上了，后来我问了这两个男生麻花和琳琳都是第一次见。
	//	女生在有好感的男生面前原来是这样子的啊，可以主动到这个程度啊，第一次见。平时琳琳瞅着还是很正常的状态，上头之后就不太一样了，也算是见到不一样的一面了。
	//	喝酒之后就去吃了火锅，吃完火锅到家就已经是5点了，周六的五点，哈哈哈哈上周是周六四点到家五点睡觉，这周是五点到家六点睡觉，真不错啊。
	//	之后再10点的时候睡醒了，就收拾收拾，赶紧去玩本了。一个叫做《阿卡姆症候群》的推理本。开本的DM很漂亮，声音也很好听。本子也很不错。难度不高，适合新手
	//	17约的这个本，说是要介绍一个微胖，但是很可爱的女生给我认识。见了之后，emmmm,说实话没有什么感觉，也没有想认识的感觉。就没有加微信。这两天17也没有提了。
	//	晚上六点玩完本，去17家拿了生日礼物，一把雷明顿散弹枪积木板，哈哈哈哈，真不错。这回周日有事情做了，周日花了两个小时拼好了，发射弹簧的还挺好玩的。
	//	这几天去跑步两天，看了一个恋综《喜欢你，我也是》还挺有意思的，周日还熬夜了，这周还是见了好多人。
	//	梳理了一下这一个星期，感觉很开心。哈哈哈哈哈哈
	//2024年7月1日10:05:49 星期一
	//	距离上一次写日记没几天，但是我感觉过了好久啊，可能是因为这几天过的太快乐了吧
	//	上周一到周五，休息的不是很好，精神也不太好，工作上的事情也没做多少。
	//	周日是勤儿的生日，也就是昨天，她邀请我去庆祝她的生日，还有她室友，一共四个人。但是我周日有个机制本，没办法去，就是很遗憾。
	//	那我就想周六的时候，看勤儿有没有空，周六给她庆祝生日，她在周日和室友庆祝生日。哈哈哈
	//      周六我们一起去滑雪，滑的很开心。我拍的录像特别棒。滑完雪就去吃了烤肉，整体来说周六真的是太快乐了。
	//	周日和破晓一起玩机制本，第一次独赢，咔咔乱杀。除了死敌全是盟友，掌控全局。
	//	这两天真的是太开心了。整个六月见了将近20位微信好友。和将近10个不能见面的微信好友聊天。30个微信好友，100个微信好友联系了三分之一我很满足了
	//	今天还是输入的生日，也是白羊离开杭州，回西安的的送别宴，没想到7月的第一天就这么重要
	//2024年7月4日14:11:50 星期四
	//	这几天猛猛工作，我想把上周末的快乐保留的更久一点，我就开始很自律的作息，感觉不规律的作息会更消耗快乐。
	//	一号，去聚串儿和，破晓，花，花花，婷婷，小猫，输入，白羊，一起吃饭。小猫买了蛋糕给输入，我们一起给输出唱了生日歌，我们饭大约8点半很快就吃完了，一直在聊天，聊到的11点。一直再聊。
	//	二号，感觉快乐好像少一点了。它在慢慢的流逝。
	//	三号，白羊说明天四点的飞机，要走了。要在我家睡一宿，房子今天要退了。我说好啊。晚上下班我去白羊那里看他把自己的行李寄走，寄了570，还有一部分明天寄出去估计总共要800块钱。
	//	行李寄完，就去了我家把东西放下，我领着他去了，我认为非常好吃的一家店，让他离开杭州的最后的时间里，享受一下美食。他吃的很开心，说很好吃，我们交流的回想对于感情的看法。哈哈哈都是怂货。
	//	吃完饭，我们沿着西湖走了一趟，没想到夜晚12点了，西湖边还是有很多人的，有情侣，有歌手，有直播，他们在唱歌。挺有意思的。看着车水马龙的灯光，听着悠悠的歌声，很不错。
	//	四号，回到家，1点钟，很快就睡了，4点，白羊就去赶飞机，8点20，我起床，看到白羊睡的位置已经没有人了，我还看到他的电子烟，之后我起身去洗漱，看到马桶盖子放下了，翻开马桶盖
	//	挖槽，，一大坨，在马桶里，哥们留下了一个炸弹，马桶给堵了，我憋着气，，通马桶，都想吐，我凑了。人走了还给我留下这么大个惊喜，提神醒脑了属实是。
	//      之后去上班，感觉已经没有前几天那么快乐了，就像吃了兴奋剂，药效过了。稍微有点落寞。我又重新看了，滑雪的视频，很多遍。但是前几天那种，身心都很开心的感觉，还是不见了
	//	我开始告诉自己，开心的感觉总会溜走的，平淡自然才是常态，看看开心过后给我留下了什么，我这几天很自律，我的心里状态变的更好了。这些就是留下的东西吧
	//	来上班，上班没多久就有突然的快乐，还是好几份快乐真好
        //      第一份快乐，17约了14号要去玩RPG的密室，那个密室打折了，平常要将近400块，现在不到300百了，很不错，而且那个密室很好玩。
	//	第二份快乐，我的一个很久很久没有联系的同事，评论我的朋友圈，这是一首民谣吗，哈哈哈太开心了，朋友圈的最高评价哈哈哈哈。
	//	第三份快乐，我叫勤一起玩RPG密室，对14号那一天就是有点迫不及待了。哈哈哈哈哈
	//	晚上我会再去跑步的，要加油啊。留住这份快乐
	//2024年7月8日11:28:20 星期一
	//	上周四的晚上去和输入喝酒了，喝的很快乐，喝多了，没有短片，应该短片的那股劲上来的时候我已经睡着了。哈哈哈哈哈
	//	周五的时候就很难受了，酒劲一整天都没过去，白天的时候，破晓还给我算了一卦，算了我的姻缘。
	//	和我想的是一样的，我有点不知道怎么办了，一个声音告诉我，重在当下，享受当下，不要被没有发生的事情束缚住自己。
	//	另外一个声音，没有结果就果断一点，有点内耗了。反正影响我开心的心情，内心还是有点容易收到影响的。状态不是满的时候，要离这种影响心情的事情远一点。
	//	周五晚上本来打算去开卡丁车， 因为酒劲没过，太困了，就回家了睡觉了，睡到半夜11点，后半夜基本就没咋睡了。
	//	周六约了小猫，输入去滑雪，但是他们两个都病了，身体素质都挺令人堪忧的。滑雪我也没去，因为我熬夜了，要是没熬夜我应该会自己去的。
	//	这两天下来说明，健康的作息很重要，因为作息的问题我少了很多的快乐。周六半夜12点半，破晓说他有个车要我顶一下，我想着我周六都没出门，那就顶一下吧。
	//	周日 11点起床，12点到地方开始玩本，发现作息很好，确实人的状态也很好。这个本整体来说智商还是在线的。第一次和全是陌生人的车玩本。感觉大家都挺尬的。玩到后面还好一点
	//	这几天看到了很好的几句话，记录一下吧。
	//	1.高级的感情，最终形成精神和意识，低级的感情，只能沦为脾气和情绪。
	//	2.有些感情纠缠久了，到后来你已经分不清楚，到底你是要爱，还是要赢。
	//2024年7月15日14:15:07 星期一
	//	上周没有发生什么，，很平淡，每天跑步，体重目前维持在145左右，每天都去跑步一天都没落下，还是很棒的。
	//	上上周的时候就和勤约好了14号的时候要去玩RPG密室，坚持了半个月跑步会有很大的变化吧。会变帅一点吧，
	//	勤说她室友可能会来，室友说价钱有点贵，后来又说有帅哥就来，我发了照片是去年 我，小陆，家辉，还有刘晨，在我家给家辉对象过生日的合照，她室友说不是她喜欢的类型。最后她室友就没来了。
	//	勤说她也觉得这个价格稍微有点贵的，但是因为我的邀请，不能扫我的兴，还是要来的，我说下次觉得贵就直接说啦没关系，咱们谁和谁啊，这个密室我也是很久才会玩一次，这次是真的很想叫你一起，你刚开始说有点贵，我也会想办法上车滴。
	//      周六的时候中午我吃完午饭，12点去弄了下头发，把头发烫了一下，染了一下，不太喜欢黄色了，染回黑色了。老板说感觉哪里不好看，掉颜色什么的，一个月之内都可以回来免费修，我说只要明天是最好看的就可以，之后好不好看不重要。
	//	下午五点左右头发弄完了。弄完头发回家睡了半个小时，醒来去健身房跑步运动，跑了一个小时，回家快到7点了吧，7.30 跟小猫 输入约好了玩剧本杀，得赶紧赶过去，准时到了没有迟到，周六时间还是比较紧的。
	//	剧本叫《脏瞳》 是一个系列的第一部，感觉还不错，时间也不长，11点多就结束了，到家不到12点，收拾准备了一下周日密室要带的东西就赶紧睡了，周日要精力十足！
	//	周日安排的是 下午一点的密室，玩到下午三点半，之后去KTV，玩到下午六点-七点之间，之后去吃铁锅炖，去吃山河屯，在哈尔滨就很好吃的一家店，没想到在杭州也有店。
	//	周日迷迷糊糊的睡醒了，9点左右吧，看到8点多勤跟我说她肚子不舒服，上吐下泻。今天要去医院看一看，让室友过替她。我说有人陪她一起去医院么，让你室友陪你一起去吧，缺人我这边和店家说一下，协调一下就好了。
	//	10点多，勤回复了，我说有人陪你去医院吗，她说找室友吧，我说你确认一下，没人陪你去我就陪你去，我先去洗漱一下。我洗漱完回来看消息，她说把室友叫醒了准备去医院了，但是感觉到医院就将近中午了，医生会不会下班了，要等到下午。
	//	我查了一下，她附近的医院，关注了公众号，把联系方式发过去让她问了一下，说有号，她就出发去医院。算是安排好了她这个事情。
	//	我再给慧琳打电话，我说你们今天有时间么，我这密室缺人了，你和你对象一起过来，我给你们出密室的钱，慧琳说他要搬家，而且前一天他对象还熬夜了。今天特别忙，来不了了。 
	//	我又给了刘晨打电话，我说你在杭州么，我这密室缺人了，你和你对象一起来玩吧，我出密室的钱，刘晨问说，你们是缺一个人密室就开不了了么。我说嗯呢，他说过10分钟给我消息。10分钟之后他说来。好兄弟啊。
	//	我还在群里 艾特了 17  小陆 家辉 看看能不能找个人，刘晨来了 我就跟他们说了一下不用找了，但是小陆一直没说话。我又给小陆打了语音，他没接，我就去他家，提供了上门叫醒服务，把他敲醒了。
	//	周日的密室就算平平稳稳的可以继续玩了。有我 家辉 小小杨 小陆 小火龙 17 姗姗 刘晨 我们8个人
	//	密室是一个黑帮的老大死了，帮内的两个堂主要竞争上岗，我们8个分别加入两个堂主麾下，支持他们登上帮主之位，贡献最大的可以继任堂主。
	//	小小杨真猛啊一个人获得了42个积分。我们多的也就将近30，少的就10个，这积分要一个一个任务跑下来的。第一次玩这个密室获得这么多积分。真的太厉害了，不出意料小小杨全场最多，她支持的堂主当了帮助，她也拿着拐杖接任了堂主，哈哈哈。
	//	结束之后我们准备去KTV了，小陆说没玩够还想再玩一次，每个人都很开心。都觉得这个密室很有意思。互相聊密室里发生的一些事情。看到大家这么开心。感觉这一次的安排看来还不错的。哈哈
	//	在KTV，我们唱的也很开心，刘晨的低音很好听，17和姗姗，也唱的很嗨点了很多歌，家辉一会和我们玩色子，一会唱歌，我和小陆还有小小杨玩色子，被骗傻了，弹脑瓜崩的，虽然很轻，但是也架不住一直输啊。
	//	KTV结束我问了一下勤，她下午就一直在医院打点滴。现在已经点滴结束回家了。我们准备去吃铁锅炖，他们有事情走了，剩了我和小陆，家辉和小小杨，感觉都不饿就打车回家了。
	//	周日的活动大家都开开心心的回家了。
	//	到家了之后，我稍微有点失落的，准备了很多，做了很多的安排，没想到因为她的肠胃的问题，见不到了。
	//      感情不是努力的就回报，或者说，就算努力了很多，也会因为阴差阳错，导致一切努力都没有意义，我能做的就是接受这一切。
	//      而这一切都将淹没在无言的岁月里面，在记忆深处，偶尔泛起一点涟漪。
	//	在家吃了牛肉，喝了一瓶牛奶，休息了一会，就去健身房跑步了。今天跑起来比之前都累，出的汗也更多，应该是天气闷热有点中暑感觉吧。17说她和姗姗都有中暑的感觉。
        //      我问了下大家有些人疲惫的症状重一些，有些轻一些，希望大家都健健康康的，快乐的开启新的一周。
}





































